[{"title":"过善于思考的人生，别总选易走的路","date":"2017-03-30T12:31:20.000Z","path":"2017/03/30/过善于思考的人生，别总选易走的路/","text":"&emsp;&emsp;昨天去闺蜜家玩，两人不知不觉聊到了生活方向这个问题，感触颇深，决定写篇随笔记录一下~ &emsp;&emsp;洋学习影视表演专业，现在自己开起了服装网店，日子看起来即使不是特别潇洒也还算自由自在。其实周围好多人都有疑惑，看似不搭调的两个人是如何成为闺蜜的。这里顺便解释一下，我俩是小学同学，到现在已经有十余载的年岁了，虽然走的路不同，但一种似亲情的友谊是与学识经历这些关系不大的。 &emsp;&emsp;回想之前她在化大当老师的时候，就总在业余时间做兼职，两人见面基本都会谈起将来道路选择问题。没有人是真正轻松的，我的付出在于这些年的努力学习，而她的辛苦则体现在各种人际社会关系的处理。轻松欢乐的表面背后，都是不为人知的付出。 &emsp;&emsp;这次，聊到了将来的工作选择上，洋又一次点醒了我。大四时候曾想过自己创业，但在了解一系列流程操作之后发现前路坎坷迷茫而毅然选择了放弃，只想着安安稳稳找家国企有个户口就好。不求轰轰烈烈，只求平平淡淡。现在并不是说这个想法不好，只是缺少了一种趁着年轻勇于奋斗的拼劲。如果二十多岁就过着养老生活，岂不白白浪费青春年华？ &emsp;&emsp;在北京两个非常现实的问题：一是户口，二是住房。现在想起大三时的自己还真的是任性，借着有出国留学经历就觉得即使不读研也可以在企业中风生水起。当时固执地坚持着保不了研就工作的理念，庆幸自己的成绩帮自己选了一条不至于后悔的路，离户口和住房更近了一步。而前一阵子炒饭传给我一张自己写的大二规划的照片，不禁感慨，原来大二自己的思想已经如此成熟了，而且再次体会到思考与规划的价值所在。 &emsp;&emsp;两周前和梦莹聊到她的规划，在企业里做金融方面的计算机实习或工作，空闲时间再自己搭个网站，逐步运营起来~相较而言梦莹的生活更加潇洒，寻找自己喜欢的城市呆十年八年，不用被太多的身外之物所牵绊。奈何自己做不到这么洒脱，旅游是一种放空心灵的方式，但它于我只能是一种附属而非生活。 &emsp;&emsp;今天项目组开会时候调侃道我们不断思考并发task归根到底还是因为穷，如果真能有几百TB级的服务器就都不是事了。穷则思变，而善思则掌局。既然选择了在北京发展，又并非含着金汤匙出生的公主，就应该认真对待生活，仔细规划发展道路。即使没有太大的抱负要感天动地，也不能抱着得过且过的思想，毕竟能挥霍的日子并不多了。 &emsp;&emsp;回到之前的现实状况：户口方面存在两个选择：（1）找国企或者央企，以应届毕业生的身份解决北京户口；（2）出国留学，用海外学位证换外企的北京户口指标。而住房方面现在只能总结一个字：穷。之前网上流行的一个段子：“最近用自己月薪3000攒下的1W，加老爸给的100W，刚刚好付了首付”，而现在更多的是“我真的还想再活五百年”。 &emsp;&emsp;痛定思痛，唯有创新。昨天刘洋向我介绍了好多小型的辅助工具：或微信埋雷抢红包，或批量自动添加好友，或接活帮小公司维护网站。。。在大企业中干活终究是个螺丝钉，还或许是备用的；而自己拥有能做主的事业才是真实掌握在手中的财富。虽说条条大路通罗马，但贫富差距也随之越来越大。 &emsp;&emsp;不觉间已经写了这么多，最后定几个小目标吧：&emsp;&emsp;&emsp;1. 依然坚持每天背单词看阅读打卡；&emsp;&emsp;&emsp;2. 从现在起每想到一个新鲜的idea立即做记录；&emsp;&emsp;&emsp;3. 每周为博客添一点色彩：不论是技术文章、生活随笔、或周边风景；&emsp;&emsp;&emsp;4. 每周看一篇关于人际交流或职场生活的文章；&emsp;&emsp;&emsp;5. 每月涉猎一个自己不熟悉的领域知识；&emsp;&emsp;&emsp;6. 找工作时，对比选择一个发展前景广并切实符合自己兴趣的公司。&emsp;&emsp;ps:其实还有一个大目标：我要减肥！！！/(ㄒoㄒ)/~","tags":[{"name":"随笔","slug":"随笔","permalink":"http://blog.killyliu.com/tags/随笔/"}]},{"title":"走在青春的路上","date":"2017-03-28T04:05:59.000Z","path":"2017/03/28/走在青春的路上/","text":"&emsp;&emsp;曾经幻想过自己将来的生活：或许能够成为企业中一名核心人物，运筹帷幄；亦或开一间小店平平淡淡过日子，岁月静好；也不排除辗转于世界各地，随遇而安。无论如何，我的青春我做主。 时光&emsp;&emsp;都说岁月无痕，只是不那么明显罢了。回想小时候，可能因为玩具脏了心情不爽就大哭一场，一切都是那么随性而为之。而当身上肩负的责任越来越多之后，正如邓紫棋歌中所唱，“你的笑只是你穿的保护色”，有时照顾他人的情绪要多于自己，越来越明白为什么人们总是怀念童年了。&emsp;&emsp;而人生没有如果，穿梭时光的机器属于大雄和叮当猫，但不属于我们。有时觉得时间一分一秒都是那么漫长，有时又不禁感慨时间流逝速度之快，并非是时光的魔法，一切均由心生。。。 经历&emsp;&emsp;“似水流年或沧海桑田，总是一眨眼消失在转身的那瞬间；沿途流逝的画面，时光如风掠过了双眼，阡陌稻田，远山云烟”。这些年，我们走过的路、看过的风景，都逐渐化作了经历，不知不觉间影响着为人与处事风格，或成熟稳重，或举步生风。&emsp;&emsp;懵懂时的好奇，悸动时的冲动，成熟时的稳重，都为成长的路上增添了许多色彩，而我也愈发喜欢这样的生活，这样的自己。经历过春夏秋冬的洗礼，体味过朝阳夕下的轮回，渐渐懂得了何时该温婉，何时该冷傲，何时该耀眼，何时该淡然。 梦想&emsp;&emsp;如果说杰伦的《梦想启动》充满积极正能量的话，范范《最初的梦想》则道明了路途中的坎坷与荆棘。古有“长风破浪会有时，直挂云帆济苍海”，今有“既然选择了远方，便只顾风雨兼程”。虽说三千繁华，弹指刹那，但掌握在自己手中的岁月不过百年而已。既已知晓，又如何任时光蹉跎？&emsp;&emsp;仰望星空与脚踏实地，永恒不变的主题，又有谁真正能问心无愧。合抱之木，生于毫末；九层之合，起于垒土；千里之行，始于足下。","tags":[{"name":"随笔","slug":"随笔","permalink":"http://blog.killyliu.com/tags/随笔/"}]},{"title":"Hello World","date":"2017-03-27T13:11:17.000Z","path":"2017/03/27/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[{"name":"技术","slug":"技术","permalink":"http://blog.killyliu.com/tags/技术/"}]}]